# =============================================================================
# ПОЛЬЗОВАТЕЛЬСКИЕ ФУНКЦИИ БИБЛИОТЕКИ
# =============================================================================
# Утилиты, расширяющие nixpkgs.lib через оверлей.
# Доступны как lib.exe во всей конфигурации.
# =============================================================================
{ lib }:

{
  # Полный путь к исполняемому файлу пакета
  # lib.exe pkgs.fish => "/nix/store/...-fish-3.6.0/bin/fish"
  exe = pkg: "${lib.getBin pkg}/bin/${pkg.pname or pkg.name}";
}
